In [1]:
import numpy as np
import pandas as pd

In [2]:
seles_numbers = np.random.randint(20,size = (7,3))
seles_numbers

array([[17,  7, 10],
       [14, 15, 19],
       [10, 15,  4],
       [12,  3, 17],
       [16, 18,  2],
       [ 2, 14,  8],
       [ 2,  2,  9]])

In [5]:
weekly_seles = pd.DataFrame(seles_numbers,
                            index = ["saturday","sunday","monday","tuesday","wednesday","thursday","friday"],
                            columns = ["pizza","sandwich","burger"])
weekly_seles

           pizza  sandwich  burger
saturday      17         7      10
sunday        14        15      19
monday        10        15       4
tuesday       12         3      17
wednesday     16        18       2
thursday       2        14       8
friday         2         2       9

In [11]:
prices = np.array([20,15,17])
prices.shape=(1,3)

In [14]:
food_seles = pd.DataFrame(prices,
                            index = ["price"],
                            columns = ["pizza","sandwich","burger"])
food_seles

       pizza  sandwich  burger
price     20        15      17

In [15]:
food_seles.shape , weekly_seles.shape

((1, 3), (7, 3))

In [18]:
total_seles = food_seles.dot(weekly_seles.T)
total_seles

       saturday  sunday  monday  tuesday  wednesday  thursday  friday
price       615     828     493      574        624       386     223

In [19]:
total_seles.shape

(1, 7)

In [21]:
weekly_seles["total"] = total_seles.T
weekly_seles

           pizza  sandwich  burger  total
saturday      17         7      10    615
sunday        14        15      19    828
monday        10        15       4    493
tuesday       12         3      17    574
wednesday     16        18       2    624
thursday       2        14       8    386
friday         2         2       9    223